article/spiped.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>spiped</title>
<!-- 2017-10-19 Thu 10:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ice" />
</head>
<body>
<div id="content">
<h1 class="title">spiped</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Spiped简介</a></li>
<li><a href="#sec-2">2. Spiped原理</a></li>
<li><a href="#sec-3">3. Spiped安装</a></li>
<li><a href="#sec-4">4. Spiped使用</a>
<ul>
<li><a href="#sec-4-1">4.1. 在服务端生成好密钥文件，将该文件复制到客户端</a></li>
<li><a href="#sec-4-2">4.2. 在服务端创建代理</a></li>
<li><a href="#sec-4-3">4.3. 在客户端创建代理</a></li>
<li><a href="#sec-4-4">4.4. 服务端程序不需要做任何调整，客户端程序需要将数据发送到本地代理端口</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Spiped简介</h2>
<div class="outline-text-2" id="text-1">
<p>
Spiped是一个用于创建套接字地址之间的对称加密和认证管道的工具，
以便连接到一个地址的源端（例如，在本地主机上一个UNIX套接字），
可以透明地建立连接到另一个地址（例如，一个不同系统上的UNIX套接字）
</p>

<p>
www.tarsnap.com/spiped.html
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Spiped原理</h2>
<div class="outline-text-2" id="text-2">
<p>
Spiped相当于本地代理。代理客户端将数据发送给服务端。
客户端将数据发送本地spiped代理端口，由spiped将数据发送到服务端的spiped代理，
服务端spiped代理将数据转发真实的服务端端口
client -&gt; spiped proxy(client) -&gt; INTERNET -&gt; spiped proxy(server) -&gt; server
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Spiped安装</h2>
<div class="outline-text-2" id="text-3">
<p>
tar zxvf spiped-1.6.0.tgz
cd spiped-1.6.0
make &amp;&amp; make install
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Spiped使用</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 在服务端生成好密钥文件，将该文件复制到客户端</h3>
<div class="outline-text-3" id="text-4-1">
<p>
dd if=/dev/urandom bs=32 count=1 of=keyfile
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 在服务端创建代理</h3>
<div class="outline-text-3" id="text-4-2">
<p>
spiped -d -s '[0.0.0.0]:8025' -t '[127.0.0.1]:25' -k keyfile
8025是spiped的代理端口，25是真实服务端端口
作用：将8025端口的数据转发到本地25端口
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 在客户端创建代理</h3>
<div class="outline-text-3" id="text-4-3">
<p>
spiped -e -s '[127.0.0.1]:25' -t $SERVERNAME:8025 -k keyfile
25是spiped代理端口, 8025是服务端spiped的代理端口
$SERVERNAME是服务端的ip或域名
作用:将本地25端口的数据转发到服务端8025端口
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 服务端程序不需要做任何调整，客户端程序需要将数据发送到本地代理端口</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ice</p>
<p class="date">Created: 2017-10-19 Thu 10:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
